AllRuleParametersApplicable Method
Overload List
Name | Description
AllRuleParametersApplicable(ElementFilter)
 Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories.
AllRuleParametersApplicable(Document, ICollectionElementId, ElementFilter)
 Checks that the parameters of the given ElementFilter (representing a combination of rules) are valid for the given set of categories.
See Also
ParameterFilterElement Class
ParameterFilterElement Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →